<a href="https://colab.research.google.com/github/S-Soluel/CS_167_Colab_Files/blob/main/CS167_Day2_Notes.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#CS 167: Day 2 Notes

###Overview of Pandas

In [1]:
#you should be able to run this without any issue.
import pandas as pd

from google.colab import drive
drive.mount('/content/drive')

#change this path to point to where your data is:
# if you're using colab it should be something like: '/content/drive/MyDrive/CS167/datasets/restaurant.csv'
path = '/content/drive/MyDrive/JTerm2023/datasets/restaurant.csv'

restaurant_data = pd.read_csv(path)
print("data is a ", type(restaurant_data))

Mounted at /content/drive
data is a  <class 'pandas.core.frame.DataFrame'>

Group Exercise: On Columns
---
subset - ages = holds all ages of the passengers on the titanic

---
subset 2 - titanic_subset - survived, deck, sex, age

In [2]:
path1 = '/content/drive/MyDrive/JTerm2023/datasets/titanic.csv'

titanic = pd.read_csv(path1)
# look and make sure titanic was read in right

# First subset: getting the ages given
ages = titanic['age']
ages.head()

# Getting second subset: whether someone survived, their deck, sex, and age in that order
titanic_subset = titanic[['survived', 'deck', 'sex', 'age']]
titanic_subset

     survived deck     sex   age
0           0  NaN    male  22.0
1           1    C  female  38.0
2           1  NaN  female  26.0
3           1    C  female  35.0
4           0  NaN    male  35.0
..        ...  ...     ...   ...
886         0  NaN    male  27.0
887         1    B  female  19.0
888         0  NaN  female   NaN
889         1    C    male  26.0
890         0  NaN    male  32.0

[891 rows x 4 columns]

Try Subsetting Rows
---

In [3]:
restaurant_data.head()

rainy_day = restaurant_data[restaurant_data['rain'] == "Yes"]
rainy_day

  alt  bar  fri  hun   pat price rain  res     type   est target
5  No  Yes   No  Yes  Some    $$  Yes  Yes  Italian  0-10    Yes
6  No  Yes   No   No  None     $  Yes   No   Burger  0-10     No
7  No   No   No  Yes  Some    $$  Yes  Yes     Thai  0-10    Yes
8  No  Yes  Yes   No  Full     $  Yes   No   Burger   >60     No

Try: Subsetting by Rows and Columns
---
---

Let's imagine we want a subset that contains the names and ages of people who did not survive the Titanic.

Techincally, you have the knowledge now to be able to do this, if you just break it up into two steps:

1. make a subset, `victims`, of rows where `survived == 0`
2. use `victims` to create a second subset that only contains the `age` column.

In [4]:
# Create the victims subset and view it
victims = titanic[titanic['survived'] == 0]
victims

# Create second subset that only takes the ages of titanic victims
victims_age = victims['age']
# Print out the ages of victims
victims_age

0      22.0
4      35.0
5       NaN
6      54.0
7       2.0
       ...
884    25.0
885    39.0
886    27.0
888     NaN
890    32.0
Name: age, Length: 549, dtype: float64

# Part Two: Pandas Exercises
---

Follow-up exercises to get familiar utilizing Pandas and Python.

In [5]:
# what is the data type of titanic?
print("data is a", type(titanic))

# data type is pandas.core.frame.DataFrame -- or just a DataFrame

data is a <class 'pandas.core.frame.DataFrame'>

In [6]:
# what are the features (column titles) of the titanic dataset?

titanic.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [7]:
# display only the 'embark_town' column of the titanic data
print(titanic['embark_town'])

0      Southampton
1        Cherbourg
2      Southampton
3      Southampton
4      Southampton
          ...
886    Southampton
887    Southampton
888    Southampton
889      Cherbourg
890     Queenstown
Name: embark_town, Length: 891, dtype: object

In [8]:
# what is the data type of the result of the previous cell? 
# Series

In [9]:
# what is the "shape" of the data frame?
titanic.shape

# dataset 'shape' is 891 rows by 15 columns

(891, 15)

In [10]:
# make a subset (call the variable 'subset') of the data that consists of the last 20 rows of the data;
# verify that your subset has 20 rows

subset = titanic[871:]
print(subset)
print(subset.shape)

     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
871         1       1  female  47.0      1      1  52.5542        S   First
872         0       1    male  33.0      0      0   5.0000        S   First
873         0       3    male  47.0      0      0   9.0000        S   Third
874         1       2  female  28.0      1      0  24.0000        C  Second
875         1       3  female  15.0      0      0   7.2250        C   Third
876         0       3    male  20.0      0      0   9.8458        S   Third
877         0       3    male  19.0      0      0   7.8958        S   Third
878         0       3    male   NaN      0      0   7.8958        S   Third
879         1       1  female  56.0      0      1  83.1583        C   First
880         1       2  female  25.0      0      1  26.0000        S  Second
881         0       3    male  33.0      0      0   7.8958        S   Third
882         0       3  female  22.0      0      0  10.5167        S   Third
883         0       2    male  28.0      0      0  10.5000        S  Second
884         0       3    male  25.0      0      0   7.0500        S   Third
885         0       3  female  39.0      0      5  29.1250        Q   Third
886         0       2    male  27.0      0      0  13.0000        S  Second
887         1       1  female  19.0      0      0  30.0000        S   First
888         0       3  female   NaN      1      2  23.4500        S   Third
889         1       1    male  26.0      0      0  30.0000        C   First
890         0       3    male  32.0      0      0   7.7500        Q   Third

       who  adult_male deck  embark_town alive  alone
871  woman       False    D  Southampton   yes  False
872    man        True    B  Southampton    no   True
873    man        True  NaN  Southampton    no   True
874  woman       False  NaN    Cherbourg   yes  False
875  child       False  NaN    Cherbourg   yes   True
876    man        True  NaN  Southampton    no   True
877    man        True  NaN  Southampton    no   True
878    man        True  NaN  Southampton    no   True
879  woman       False    C    Cherbourg   yes  False
880  woman       False  NaN  Southampton   yes  False
881    man        True  NaN  Southampton    no   True
882  woman       False  NaN  Southampton    no   True
883    man        True  NaN  Southampton    no   True
884    man        True  NaN  Southampton    no   True
885  woman       False  NaN   Queenstown    no  False
886    man        True  NaN  Southampton    no   True
887  woman       False    B  Southampton   yes   True
888  woman       False  NaN  Southampton    no  False
889    man        True    C    Cherbourg   yes   True
890    man        True  NaN   Queenstown    no   True
(20, 15)

In [13]:
# use loc to print out the data for passenger 890 on the titanic dataframe
titanic.loc[890]
# use iloc to print out the data for passenger 890 on the subest dataframe
titanic.iloc[890]

survived                0
pclass                  3
sex                  male
age                  32.0
sibsp                   0
parch                   0
fare                 7.75
embarked                Q
class               Third
who                   man
adult_male           True
deck                  NaN
embark_town    Queenstown
alive                  no
alone                True
Name: 890, dtype: object

#### use a markdown cell; describe the difference between loc and iloc
---

- `loc` | This refers to rows and columns by their labels/names, and in this case 890 is the name of the row.
- `iloc` | This refers to rows and columns by their index/relative position in the dataset, and 890 refers to row 890.

In [14]:
# create a subset of the data (call the variable 'queenstown_subset') that consists only of passengers with
# a 'embark_town' that is "Queenstown"
# hint: if you get a warning, you may need to explicitly note that you are making a copy of the original data by using 
# the .copy() function

queenstown_subset = titanic[titanic['embark_town'] == "Queenstown"]
print(queenstown_subset)

     survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
5           0       3    male   NaN      0      0   8.4583        Q  Third
16          0       3    male   2.0      4      1  29.1250        Q  Third
22          1       3  female  15.0      0      0   8.0292        Q  Third
28          1       3  female   NaN      0      0   7.8792        Q  Third
32          1       3  female   NaN      0      0   7.7500        Q  Third
..        ...     ...     ...   ...    ...    ...      ...      ...    ...
790         0       3    male   NaN      0      0   7.7500        Q  Third
825         0       3    male   NaN      0      0   6.9500        Q  Third
828         1       3    male   NaN      0      0   7.7500        Q  Third
885         0       3  female  39.0      0      5  29.1250        Q  Third
890         0       3    male  32.0      0      0   7.7500        Q  Third

       who  adult_male deck embark_town alive  alone
5      man        True  NaN  Queenstown    no   True
16   child       False  NaN  Queenstown    no  False
22   child       False  NaN  Queenstown   yes   True
28   woman       False  NaN  Queenstown   yes   True
32   woman       False  NaN  Queenstown   yes   True
..     ...         ...  ...         ...   ...    ...
790    man        True  NaN  Queenstown    no   True
825    man        True  NaN  Queenstown    no   True
828    man        True  NaN  Queenstown   yes   True
885  woman       False  NaN  Queenstown    no  False
890    man        True  NaN  Queenstown    no   True

[77 rows x 15 columns]

In [15]:
# how many passengers are in queenstown_subset?
queenstown_subset.shape[0]

77

In [16]:
# what is the average age for all of those in the queenstown_subset?
# do all of the passengers have an age recorded? What is recorded if there is no age?

queenstown_subset['age'].mean()

28.089285714285715

In [25]:
# What does unique(), mean(), isnull(), and fillna() do? Use a markdown cell to write your answers
# Use the Pandas documentation (https://pandas.pydata.org/pandas-docs/stable/reference/index.html)

- `unique()` this will show all the unique or different results.
- `mean()` this gives the mean/average for a specified column.
- `isnull()` this gives a `True` / `False` value for the specified column.
- `fillna()`

In [22]:
# what is the average fare for all of those in the queenstown_subset?

mean_fare = queenstown_subset['fare'].mean()
print(mean_fare)

13.276029870129872

In [31]:
# give examples of your use of unique(), mean(), median(), isnull()

# Unique 
print(queenstown_subset['class'].unique())

# Mean
print(queenstown_subset['age'].mean())
# The mean age of people from Queenstown on the Titanic was around 28 years old.

# Median
print(queenstown_subset['fare'].median())
# The median fare paid was around $7.25

# Is Null
print(queenstown_subset['sex'].isnull())

['Third' 'First' 'Second']
28.089285714285715
7.75
5      False
16     False
22     False
28     False
32     False
       ...
790    False
825    False
828    False
885    False
890    False
Name: sex, Length: 77, dtype: bool

In [32]:
# in the queenstown_subet dataframe
# for each row that does not have an age recorded, replace the NaN value with the calculated average
# hint: don't use a loop; it can be done in 1 line of code using fillna()

queenstown_subset['age'].fillna(queenstown_subset['age'].mean())

5      28.089286
16      2.000000
22     15.000000
28     28.089286
32     28.089286
         ...
790    28.089286
825    28.089286
828    28.089286
885    39.000000
890    32.000000
Name: age, Length: 77, dtype: float64

In [45]:
# load in the iris data
path2 = '/content/drive/MyDrive/JTerm2023/datasets/irisData.csv'

iris = pd.read_csv(path2)
print("data is a ", type(iris))

print(iris)
# what is the median sepal width of just the Setosas?

setosa_subset = iris[(iris.species == 'Iris-setosa')]
print(setosa_subset)
print("The median sepal width of the iris-setosa is", setosa_subset['sepal width'].median())

data is a  <class 'pandas.core.frame.DataFrame'>
     sepal length  sepal width  petal length  petal width         species
0             5.1          3.5           1.4          0.2     Iris-setosa
1             4.9          3.0           1.4          0.2     Iris-setosa
2             4.7          3.2           1.3          0.2     Iris-setosa
3             4.6          3.1           1.5          0.2     Iris-setosa
4             5.0          3.6           1.4          0.2     Iris-setosa
..            ...          ...           ...          ...             ...
145           6.7          3.0           5.2          2.3  Iris-virginica
146           6.3          2.5           5.0          1.9  Iris-virginica
147           6.5          3.0           5.2          2.0  Iris-virginica
148           6.2          3.4           5.4          2.3  Iris-virginica
149           5.9          3.0           5.1          1.8  Iris-virginica

[150 rows x 5 columns]
    sepal length  sepal width  petal length  petal width      species
0            5.1          3.5           1.4          0.2  Iris-setosa
1            4.9          3.0           1.4          0.2  Iris-setosa
2            4.7          3.2           1.3          0.2  Iris-setosa
3            4.6          3.1           1.5          0.2  Iris-setosa
4            5.0          3.6           1.4          0.2  Iris-setosa
5            5.4          3.9           1.7          0.4  Iris-setosa
6            4.6          3.4           1.4          0.3  Iris-setosa
7            5.0          3.4           1.5          0.2  Iris-setosa
8            4.4          2.9           1.4          0.2  Iris-setosa
9            4.9          3.1           1.5          0.1  Iris-setosa
10           5.4          3.7           1.5          0.2  Iris-setosa
11           4.8          3.4           1.6          0.2  Iris-setosa
12           4.8          3.0           1.4          0.1  Iris-setosa
13           4.3          3.0           1.1          0.1  Iris-setosa
14           5.8          4.0           1.2          0.2  Iris-setosa
15           5.7          4.4           1.5          0.4  Iris-setosa
16           5.4          3.9           1.3          0.4  Iris-setosa
17           5.1          3.5           1.4          0.3  Iris-setosa
18           5.7          3.8           1.7          0.3  Iris-setosa
19           5.1          3.8           1.5          0.3  Iris-setosa
20           5.4          3.4           1.7          0.2  Iris-setosa
21           5.1          3.7           1.5          0.4  Iris-setosa
22           4.6          3.6           1.0          0.2  Iris-setosa
23           5.1          3.3           1.7          0.5  Iris-setosa
24           4.8          3.4           1.9          0.2  Iris-setosa
25           5.0          3.0           1.6          0.2  Iris-setosa
26           5.0          3.4           1.6          0.4  Iris-setosa
27           5.2          3.5           1.5          0.2  Iris-setosa
28           5.2          3.4           1.4          0.2  Iris-setosa
29           4.7          3.2           1.6          0.2  Iris-setosa
30           4.8          3.1           1.6          0.2  Iris-setosa
31           5.4          3.4           1.5          0.4  Iris-setosa
32           5.2          4.1           1.5          0.1  Iris-setosa
33           5.5          4.2           1.4          0.2  Iris-setosa
34           4.9          3.1           1.5          0.1  Iris-setosa
35           5.0          3.2           1.2          0.2  Iris-setosa
36           5.5          3.5           1.3          0.2  Iris-setosa
37           4.9          3.1           1.5          0.1  Iris-setosa
38           4.4          3.0           1.3          0.2  Iris-setosa
39           5.1          3.4           1.5          0.2  Iris-setosa
40           5.0          3.5           1.3          0.3  Iris-setosa
41           4.5          2.3           1.3          0.3  Iris-setosa
42           4.4          3.2           1.3          0.2  Iris-setosa
43           5.0          3.5           1.6          0.6  Iris-setosa
44           5.1          3.8           1.9          0.4  Iris-setosa
45           4.8          3.0           1.4          0.3  Iris-setosa
46           5.1          3.8           1.6          0.2  Iris-setosa
47           4.6          3.2           1.4          0.2  Iris-setosa
48           5.3          3.7           1.5          0.2  Iris-setosa
49           5.0          3.3           1.4          0.2  Iris-setosa
The median sepal width of the iris-setosa is 3.4

In [55]:
# for those iris that are classified as versicolor and have 
# a petal-length > 4, what is the average sepal width?
print(iris['species'].unique())

versicolor = iris[(iris['species'] == 'Iris-versicolor') & (iris['petal length'] > 4)]

print("The average sepal width in this subset is ", versicolor['sepal width'].mean(), "or around 2.9.")

['Iris-setosa' 'Iris-versicolor' 'Iris-virginica']
The average sepal width in this subset is  2.902941176470588 or around 2.9.